Revit 2026 API

# ElectricalSystemAddToCircuit Method

---

Add a set of exist components to the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AddToCircuit(
	ElementSet components
)
```
```vb
Public Function AddToCircuit (
	components As ElementSet
) As Boolean
```
```cpp
public:
bool AddToCircuit(
	ElementSet^ components
)
```
```fsharp
member AddToCircuit :
        components : ElementSet -> bool
```

#### Parameters

components ElementSet
    The components added to the electrical system.

#### Return Value

BooleanIf successful, all the components will add to the system. Otherwise  is returned.

This method will only function with the Autodesk Revit MEP application.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace